# -*- org-export-with-todo-keywords: nil; org-export-use-babel: t; org-edit-src-content-indentation: 2; org-src-preserve-indentation: nil; org-babel-results-keyword: "results"; org-image-actual-width: 1100; org-make-toc-insert-custom-ids: t; org-pandoc-format-extensions: (markdown_github+pipe_tables+raw_html); -*-
#+PROPERTY: HEADER-ARGS                 :eval never-export
#+PROPERTY: HEADER-ARGS:shell           :shebang /bin/bash
#+PROPERTY: HEADER-ARGS:jupyter-python  :session 20250214_gh712_jitter_sim
#+EXPORT_FILE_NAME: README
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil

* SECTION Test summary                                              :noipynb:
  :PROPERTIES:
  :CUSTOM_ID: test-summary
  :END:

*Test:* =20250214_gh712_jitter_sim= Simulation of peak jitter algorithms.

*Date:*

#+begin_src shell :results drawer :exports results :prologue ""
  date "+%a %d %b %Y"
#+end_src

#+results:
:results:
Sat 15 Feb 2025
:end:

*Jupyter notebook:*

[[file:README.ipynb][=README.ipynb=]]

** PyTest

#+begin_src shell :results verbatim :exports both
  pytest -v --no-header --doctest-modules sim
#+end_src

#+results:
: ============================= test session starts ==============================
: collecting ... collected 4 items
: 
: sim/jitter_meter.py::sim.jitter_meter.JitterMeterA PASSED                [ 25%]
: sim/mov_stats.py::sim.mov_stats.MovAvgStd PASSED                         [ 50%]
: sim/mov_stats.py::sim.mov_stats.MovMinMax PASSED                         [ 75%]
: sim/mov_stats.py::sim.mov_stats.MovQuantile PASSED                       [100%]
: 
: ============================== 4 passed in 0.74s ===============================

